In [2]:
import pandas as pd
import numpy as np

- 변수명이 두번 이상 출력되어도 모두 콘솔에서 보여주는 모듈

In [3]:
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = 'all'

**데이터 프레임 인덱서** : loc, iloc  
loc : 라벨값 기반의 2차원 인덱싱  
iloc : 순서를 나타내는 정수 기반의 2차원 인덱싱

In [5]:
df = pd.DataFrame(np.arange(12).reshape(3,4), index=['a','b','c'], columns=['A','B','C','D'])
df

   A  B   C   D
a  0  1   2   3
b  4  5   6   7
c  8  9  10  11

In [6]:
df.loc['b']

A    4
B    5
C    6
D    7
Name: b, dtype: int32

In [9]:
df.loc['b':'c']

   A  B   C   D
b  4  5   6   7
c  8  9  10  11

In [10]:
df[0:2]

   A  B  C  D
a  0  1  2  3
b  4  5  6  7

In [12]:
df.loc[['a','c']]

   A  B   C   D
a  0  1   2   3
c  8  9  10  11

In [13]:
df['A']

a    0
b    4
c    8
Name: A, dtype: int32

In [14]:
df[['A']]

   A
a  0
b  4
c  8

In [17]:
df[['A','C']]

   A   C
a  0   2
b  4   6
c  8  10

Boolean

In [18]:
df

   A  B   C   D
a  0  1   2   3
b  4  5   6   7
c  8  9  10  11

In [19]:
df.B

a    1
b    5
c    9
Name: B, dtype: int32

In [20]:
df.B >= 5

a    False
b     True
c     True
Name: B, dtype: bool

In [21]:
df.loc[df.C > 5]

   A  B   C   D
b  4  5   6   7
c  8  9  10  11

In [22]:
df.loc[df['C']>5]

   A  B   C   D
b  4  5   6   7
c  8  9  10  11

In [23]:
def sel_row(df):
    return df.B > 5

In [24]:
sel_row(df)

a    False
b    False
c     True
Name: B, dtype: bool

In [25]:
df.loc[sel_row(df)]

   A  B   C   D
c  8  9  10  11

In [26]:
df

   A  B   C   D
a  0  1   2   3
b  4  5   6   7
c  8  9  10  11

In [28]:
df[1:2]

   A  B  C  D
b  4  5  6  7

In [29]:
df.loc['b','C']

6

In [32]:
df.loc['a','A'] = 100
df

     A  B   C   D
a  100  1   2   3
b    4  5   6   7
c    8  9  10  11

In [34]:
df.loc[['a','b'], ['B']]

   B
a  1
b  5

In [35]:
df.loc[['a','b'],'B']

a    1
b    5
Name: B, dtype: int32

In [36]:
df.loc[['a','b']]['A']

a    100
b      4
Name: A, dtype: int32

In [37]:
df

     A  B   C   D
a  100  1   2   3
b    4  5   6   7
c    8  9  10  11

In [42]:
df.loc[['a'], 'B':'C']

   B  C
a  1  2

In [52]:
df.loc['b':'c'][['A']]

   A
b  4
c  8

In [57]:
df.loc[['a','c']][['A','C']]

     A   C
a  100   2
c    8  10

iloc 인덱서

In [58]:
df

     A  B   C   D
a  100  1   2   3
b    4  5   6   7
c    8  9  10  11

In [59]:
df.iloc[0,3]

3

In [60]:
df.iloc[1:2]

   A  B  C  D
b  4  5  6  7

In [61]:
df.iloc[1:2, 1:3]

   B  C
b  5  6

In [63]:
df.iloc[1:3, 0]

b    4
c    8
Name: A, dtype: int32